/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_key_len.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/02/28 16:26:36 by budelphi          #+#    #+#             */
/*   Updated: 2021/03/16 10:18:49 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../minishell.h"

/*
** Что делает функция:		Считает длину ключа.
**
** Возращаемое значение:	Успех	- Длина ключа.
**							Ошибка	- (-1).
**
** Особенности:				Проверяет валидность ключа.
**							Не передвигает строку форматирования.
*/

int		ft_key_len(char *my_key)
{
	int	key_len;

	key_len = 0;
	if (ft_isdigit(my_key[key_len]))
		return (-1);
	while ((ft_isalnum(my_key[key_len]) || my_key[key_len] == '_') \
			&& my_key[key_len])
		key_len++;
	return (key_len);
}
