/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/31 12:22:29 by budelphi          #+#    #+#             */
/*   Updated: 2021/03/03 18:11:56 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Заполняет выбранную область памяти '\0'.
**
** Возращаемое значение:	Нет.
**
** Особенности:				Нет.
*/

void	ft_bzero(void *dest, size_t count)
{
	unsigned char	*cur;

	cur = (unsigned char *)dest;
	while (count--)
		*cur++ = '\0';
}
