/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/01 16:40:02 by budelphi          #+#    #+#             */
/*   Updated: 2021/01/20 22:34:24 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Проверяет принадлежность символа к цифрам.
**
** Возращаемое значение:	1 - В случае принадлежности;
**							0 - В обратном.
**
** Особенности:				Нет.
*/

int	ft_isdigit(int c)
{
	return (c >= '0' && c <= '9');
}
