/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/01 16:58:16 by budelphi          #+#    #+#             */
/*   Updated: 2021/01/20 22:35:29 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Проверяет принадлежность символа к печатным симв.
**
** Возращаемое значение:	1 - В случае принадлежности;
**							0 - В обратном.
**
** Особенности:				Нет.
*/

int	ft_isprint(int c)
{
	return (c >= 32 && c <= 126);
}
