/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putstr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/20 21:38:17 by budelphi          #+#    #+#             */
/*   Updated: 2021/01/21 18:58:31 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Печатает строку.
**
** Возращаемое значение:	Нет.
**
** Особенности:				Чтобы не реализовывать побитовый вывод
**							сперва высчитывает длину строки.
*/

void	ft_putstr(char *str)
{
	int	len;

	if (!str)
		return ;
	len = ft_strlen(str);
	write(1, str, len);
}
