/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putstr_fd.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/04 17:06:34 by budelphi          #+#    #+#             */
/*   Updated: 2021/01/21 23:19:48 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Печатает строку в конкретный fd.
**
** Возращаемое значение:	Нет.
**
** Особенности:				Чтобы не реализовывать побитовый вывод
**							сперва высчитывает длину строки.
**
** Дополнительно:			fd == 2 - Вывод ошибок в терминал.
**							Возврат кода (-1).
*/

int	ft_putstr_fd(char *str, int fd)
{
	int	len;

	if (!str)
		return (-1);
	len = ft_strlen(str);
	write(fd, str, len);
	if (fd == 2)
		return (-1);
	return (0);
}
