/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncmp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/01 16:07:14 by budelphi          #+#    #+#             */
/*   Updated: 2021/03/16 11:55:56 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Сравнивает заданное кол-во символов в строках.
**
** Возращаемое значение:	'0' - Если n-символов в строках одинаковые.
**
** Особенности:				Чтобы не реализовывать побитовый вывод
**							сперва высчитывает длину строки.
*/

int	ft_strncmp(char *str1, char *str2, size_t n)
{
	size_t i;

	i = 0;
	if (n == 0)
		return (0);
	while (str1[i] == str2[i] && str1[i] != '\0' && str2[i] != '\0' \
		&& (i < (n - 1)))
		i++;
	return ((unsigned char)str1[i] - (unsigned char)str2[i]);
}
