/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/01 15:11:23 by budelphi          #+#    #+#             */
/*   Updated: 2021/01/22 16:36:55 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Находит первое вхождение символа в строке.
**
** Возращаемое значение:	(char *) Указатель на первое вхождение
**							символа в строке. Иначе NULL.
**
** Особенности:				Нет.
*/

char	*ft_strchr(char *str, int ch)
{
	size_t i;

	i = 0;
	while (str[i])
	{
		if (str[i] == ch)
			return ((char*)str + i);
		i++;
	}
	if (str[i] == '\0' && ch == '\0')
		return ((char*)str + i);
	return (NULL);
}
