/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: budelphi <budelphi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/01 17:03:47 by budelphi          #+#    #+#             */
/*   Updated: 2021/01/21 20:23:15 by budelphi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Что делает функция:		Переводит букву нижнего регистра в верхний.
**
** Возращаемое значение:	ASCII код буквы в нижнем регистре,
**							иначе просто код символа по ASCII.
**
** Особенности:				Нет.
*/

int	ft_toupper(int c)
{
	if ((c >= 'a' && c <= 'z'))
		return (c - 32);
	return (c);
}
